<?php

namespace Bit\ArabFaker\Providers;

class CultureProvider
{
    protected $foods = [
        'فتوش', 'تبولة', 'كبة مقلية', 'كبة نيئة', 'محشي كوسا', 'محشي باذنجان', 'يبرق', 'كباب حلبي', 'مجدرة', 'شاكرية',
        'منسف', 'شاورما دجاج', 'شاورما لحم', 'حمص', 'متبل', 'لبنة بالنعنع', 'فول مدمس', 'شوربة عدس', 'صفيحة شامية',
        'شيش برك', 'مقلوبة', 'رز بحليب', 'معمول', 'غريبة', 'مهلبية', 'زنود الست', 'كنافة نابلسية', 'عوامة', 'نابلسية',
        'برازق', 'كعك شامية', 'معكرونة بالبشاميل', 'سلق باللبن', 'بامية', 'باذنجان مخلل', 'مكدوس', 'كوارع', 'سجق بالبيض',
        'بيض عيون مع سماق', 'فريكة', 'فلافل', 'سفيحة حلبية', 'كعك بالسمسم', 'لحمة بالصينية'
    ];


    protected $idioms = [
        'الحيطان إلها آذان', 'رجع بخفي حنين', 'اللي اختشوا ماتوا', 'حط إيده بمي باردة', 'لا بيعرف راسه من رجليه',
        'جاب العيد', 'يا جبل ما يهزك ريح', 'مثل الأطرش بالزفة', 'فاتك القطار', 'على قد بساطك مد رجليك',
        'ما بيفرق عن الطاسة غير بالعطسة', 'ينفخ على اللبن من كتر ما انحرق بالمي', 'مش كل اصابعك متل بعض', 'بيسأل عن الجمل وهو عم ياكل كبده',
        'بيضحك عالمشنقة', 'بيصطاد بالمية العكرة', 'متل العصفور بإيدك ولا عشرة عالشجرة', 'صار الحكي ببلاش', 'بيدق المي بالهاون'
    ];


    protected $proverbs = [
        'امشي عدل يحتار عدوك فيك', 'كل تأخيرة فيها خيرة', 'جود من الموجود', 'إذا كان الكلام من فضة فالسكوت من ذهب',
        'القرد بعين أمه غزال', 'العين بصيرة والإيد قصيرة', 'اللي ما يعرفك ما يثمنك', 'يا مأمنة للرجال يا مأمنة للمية بالغربال',
        'حبل الكذب قصير', 'اللي بياكل لوحده بيختنق', 'رب ضارة نافعة', 'الغايب عذره معه', 'اللي بيته من زجاج ما يحدف الناس بحجارة',
        'باب النجار مخلع', 'كثرة الطباخين تحرق الطبخة', 'طاح الفاس بالراس', 'اللي ما يطول العنب يقول عنه حامض',
        'ما كل ما يتمنى المرء يدركه', 'من حفر حفرة لأخيه وقع فيها', 'لو كان فيه خير ما رماه الطير'
    ];


    protected $traditionalItems = [
        'طربوش', 'عباية', 'شماغ', 'صاج', 'دلة قهوة', 'نرجيلة', 'أركيلة', 'مسبحة', 'صابون الغار', 'خزانة شامية',
        'بقجة', 'طاسة نحاس', 'منقل فحم', 'قنديل كاز', 'كيس خيش', 'بوق صاج', 'جرن ومدقة', 'مسكة عنبر',
        'بسطار شامية', 'سبحة حجر كريم', 'مرآة يدوية محفورة', 'طقم شاي دمشقي', 'سكبة خزف', 'مروحة يدوية',
        'بُرْديّة', 'سجادة شرقية', 'حُقّة تبغ', 'صندوق عربي منقوش', 'ختم شمع', 'طاقية صوف شامية'
    ];


    public function food()
    {
        return $this->foods[array_rand($this->foods)];
    }

    public function idiom()
    {
        return $this->idioms[array_rand($this->idioms)];
    }

    public function proverb()
    {
        return $this->proverbs[array_rand($this->proverbs)];
    }

    public function traditionalItem()
    {
        return $this->traditionalItems[array_rand($this->traditionalItems)];
    }
}
